Fix mermaid diagrams (#6)
